[
  {
    "title": "Idea Navigator",
    "year": "2023",
    "image": "images/Idea Navigator.png",
    "description": "The Idea Navigator is a tool that automatically organize and sort your data into clusters of similar data, which you can visualize and navigate through on a 2D space."
  },
  {
    "title": "Bounce",
    "year": "2023",
    "image": "images/Bounce.png",
    "description": "Bounce is a web app that helps you keep track of your responsibilities and also helps suggests recipes and groceries."
  },
  {
    "title": "Portfolio",
    "year": "2023",
    "image": "images/Portfolio.png",
    "description": "This is my portfolio, where I showcase my projects and skills."
  },
  {
    "title": "Exploratory Data Analysis",
    "year": "2024",
    "image": "images/Exploratory Data Analysis.png",
    "description": "I examined the data on single family zoning vs other housing zoning in the Greater Boston Area and proposed solutions that could help alleviate the housing crisis."
  },
  {
    "title": "Visualization Design",
    "year": "2024",
    "image": "images/Visualization Design.png",
    "description": "I drew visualizations to help answer the question: How has the gender distribution across age groups changed from 1900 to 2000? I iterated on these designs to produce a final visualization to best answer this question."
  },
  {
    "title": "Persuasive or Deceptive Visualization?",
    "year": "2024",
    "image": "images/Persuasive or Deceptive Visualization.png",
    "description": "I designed 2 visualizations: an earnest one and a deceptive on on the proposition \"The global greenhouse gas emission decreased significantly during the COVID pandemic.\" I examined each to see what made it effective."
  },
  {
    "title": "Decaf Compiler",
    "year": "2024",
    "image": "images/Compiler.jpg",
    "description": "I am building a compiler of the Decaf programming language in Rust."
  },
  {
    "title": "Pokerbots",
    "year": "2024",
    "image": "images/Pokerbots.jpg",
    "description": "I built a program and implemented different strategies to play a variation of Poker against other programs."
  },
  {
    "title": "High School Game",
    "year": "2022",
    "image": "images/High School.jpg",
    "description": "I created a game in GameMaker Studio 2 that takes place in my high school."
  },
  {
    "title": "Box Stacker",
    "year": "2021",
    "image": "images/Box Stacker.png",
    "description": "I created a game where players have to move around boxes to advance to navigate to the next level."
  },
  {
    "title": "Rick & Morty App",
    "year": "2023",
    "image": "images/Rick & Morty.png",
    "description": "I created a website that took data from the Rick & Morty API and displayed it in a user-friendly way."
  },
  {
    "title": "2048",
    "year": "2021",
    "image": "images/2048.jpg",
    "description": "I put my game development skills to the test by recreating the popular game 2048."
  }
]
